SpenceKonde/megaTinyCore/megaavr/boards.txt
atxy4.menu.bodvoltage.1v8=1.8V
atxy4.menu.bodvoltage.2v15=2.15V
atxy4.menu.bodvoltage.2v6=2.6V
atxy4.menu.bodvoltage.2v95=2.95V
atxy4.menu.bodvoltage.3v3=3.30V
atxy4.menu.bodvoltage.3v7=3.70V
atxy4.menu.bodvoltage.4v0=4.00V
atxy4.menu.bodvoltage.4v3=4.30V
atxy4.menu.bodvoltage.4v3.bootloader.bodlevbits=111
atxy4.menu.bodvoltage.4v0.bootloader.bodlevbits=110
atxy4.menu.bodvoltage.3v7.bootloader.bodlevbits=101
atxy4.menu.bodvoltage.3v3.bootloader.bodlevbits=100
atxy4.menu.bodvoltage.2v95.bootloader.bodlevbits=011
atxy4.menu.bodvoltage.2v6.bootloader.bodlevbits=010
atxy4.menu.bodvoltage.2v15.bootloader.bodlevbits=001
atxy4.menu.bodvoltage.1v8.bootloader.bodlevbits=000
atxy4.menu.bodmodeactive.disabled=Disabled
atxy4.menu.bodmodeactive.enabled=Enabled
atxy4.menu.bodmodeactive.sampled=Sampled
atxy4.menu.bodmodeactive.enabledhold=Enabled hold wakeup
atxy4.menu.bodmodesleep.disabled=Disabled
atxy4.menu.bodmodesleep.enabled=Enabled
atxy4.menu.bodmodesleep.sampled=Sampled
atxy4.menu.bodmodeactive.disabled.bootloader.bodactivebits=00
atxy4.menu.bodmodeactive.enabled.bootloader.bodactivebits=01
atxy4.menu.bodmodeactive.sampled.bootloader.bodactivebits=10
atxy4.menu.bodmodeactive.enabledhold.bootloader.bodactivebits=11
atxy4.menu.bodmodesleep.disabled.bootloader.bodsleepbits=00
atxy4.menu.bodmodesleep.enabled.bootloader.bodsleepbits=01
atxy4.menu.bodmodesleep.sampled.bootloader.bodsleepbits=10

atxy4.menu.eesave.enable=EEPROM retained
atxy4.menu.eesave.enable.bootloader.SYSCFG0=0xC6
atxy4.menu.eesave.disable=EEPROM not retained
atxy4.menu.eesave.disable.bootloader.SYSCFG0=0xC7

atxy4.menu.dacvref.0v55=0.55V
atxy4.menu.dacvref.1v1=1.10V
atxy4.menu.dacvref.1v5=1.50V
atxy4.menu.dacvref.2v5=2.50V
atxy4.menu.dacvref.4v3=4.30V
atxy4.menu.dacvref.0v55.build.dacvref=-DDACVREF=0
atxy4.menu.dacvref.1v1.build.dacvref=-DDACVREF=1
atxy4.menu.dacvref.1v5.build.dacvref=-DDACVREF=4
atxy4.menu.dacvref.2v5.build.dacvref=-DDACVREF=2
atxy4.menu.dacvref.4v3.build.dacvref=-DDACVREF=3

atxy4.menu.millis.enabled=Enabled
atxy4.menu.millis.disabled=Disabled (saves flash)
atxy4.menu.millis.enabled.build.millis=
atxy4.menu.millis.disabled.build.millis=-DDISABLEMILLIS

atxy4.menu.neopixelport.porta=PORTA (pins 0~3,8~11)
atxy4.menu.neopixelport.portb=PORTB (pins 4~7)
atxy4.menu.neopixelport.porta.build.neopixelport=-DNEOPIXELPORT=VPORTA.OUT
atxy4.menu.neopixelport.portb.build.neopixelport=-DNEOPIXELPORT=VPORTB.OUT

atxy4.upload.tool=avrdude

atxy4.build.board=attinyxy4
atxy4.build.core=arduino
atxy4.build.variant=txy4
atxy4.build.text_section_start=.text=0x0
atxy4.build.extra_flags=-DMILLIS_USE_TIMERA0 -DNO_EXTERNAL_I2C_PULLUP {build.dacvref} {build.neopixelport} {build.millis}
atxy4.build.export_merged_output=false

atxy4.bootloader.tool=avrdude
atxy4.bootloader.WDTCFG=0x00
atxy4.bootloader.BODCFG=0b{bootloader.bodlevbits}0{bootloader.bodactivebits}{bootloader.bodsleepbits}
atxy4.bootloader.TCD0CFG=0x00
atxy4.bootloader.SYSCFG0=0xC9
atxy4.bootloader.SYSCFG1=0x03
atxy4.bootloader.APPEND=0x00
atxy4.bootloader.BOOTEND=0x00

atxy4.upload.workaround=

atxy4.menu.bootmenu.none=none
atxy4.menu.bootmenu.none.upload.protocol=jtag2updi
atxy4.menu.bootmenu.none.upload.extra_params=-e
atxy4.menu.bootmenu.none.build.text_section_start=.text=0x0
atxy4.menu.bootmenu.none.bootloader.BOOTEND=0x0

atxy4.menu.bootmenu.optiboot=optiboot_x
atxy4.menu.bootmenu.optiboot.upload.protocol=arduino
atxy4.menu.bootmenu.optiboot.upload.extra_params=-D
atxy4.menu.bootmenu.optiboot.build.text_section_start=.text=0x200
atxy4.menu.bootmenu.optiboot.bootloader.file=optiboot_x/optiboot_atxy4.hex
atxy4.menu.bootmenu.optiboot.bootloader.BOOTEND=0x2


##############################################################

atxy2.name=ATtiny412/402/212/202
atxy2.upload.speed=115200

#atxy2.menu.chip.812=ATtiny812
#atxy2.menu.chip.812.build.mcu=attiny812
#atxy2.menu.chip.812.upload.maximum_size=8192
#atxy2.menu.chip.812.upload.maximum_data_size=512
#atxy2.menu.chip.812.upload.workaround=
atxy2.menu.chip.412=ATtiny412
atxy2.menu.chip.412.build.mcu=attiny412
atxy2.menu.chip.412.upload.maximum_size=4096
atxy2.menu.chip.412.upload.maximum_data_size=256
atxy2.menu.chip.412.upload.workaround=
atxy2.menu.chip.212=ATtiny212
atxy2.menu.chip.212.build.mcu=attiny212
atxy2.menu.chip.212.upload.maximum_size=2048
atxy2.menu.chip.212.upload.maximum_data_size=128
atxy2.menu.chip.212.upload.workaround=
#atxy2.menu.chip.802=ATtiny802
#atxy2.menu.chip.802.build.mcu=attiny802
#atxy2.menu.chip.802.upload.maximum_size=8192
#atxy2.menu.chip.802.upload.maximum_data_size=512
#atxy2.menu.chip.802.upload.workaround=
atxy2.menu.chip.402=ATtiny402
atxy2.menu.chip.402.build.mcu=attiny402
atxy2.menu.chip.402.upload.maximum_size=4096
atxy2.menu.chip.402.upload.maximum_data_size=256
atxy2.menu.chip.402.upload.workaround=
atxy2.menu.chip.402w=ATtiny402 (bad signature)
atxy2.menu.chip.402w.build.mcu=attiny402
atxy2.menu.chip.402w.upload.maximum_size=4096
atxy2.menu.chip.402w.upload.maximum_data_size=256
atxy2.menu.chip.402w.upload.workaround=w
atxy2.menu.chip.202=ATtiny202
atxy2.menu.chip.202.build.mcu=attiny202
atxy2.menu.chip.202.upload.maximum_size=2048
atxy2.menu.chip.202.upload.maximum_data_size=128
atxy2.menu.chip.202.upload.workaround=

atxy2.menu.clock.20=20 MHz
atxy2.menu.clock.16=16 MHz
atxy2.menu.clock.10=10 MHz
atxy2.menu.clock.8=8 MHz
atxy2.menu.clock.5=5 MHz
atxy2.menu.clock.4=4 MHz
atxy2.menu.clock.1=1 MHz
atxy2.menu.clock.20.build.f_cpu=20000000L
atxy2.menu.clock.16.build.f_cpu=16000000L
atxy2.menu.clock.10.build.f_cpu=10000000L
atxy2.menu.clock.8.build.f_cpu=8000000L
atxy2.menu.clock.5.build.f_cpu=5000000L
atxy2.menu.clock.4.build.f_cpu=4000000L
atxy2.menu.clock.1.build.f_cpu=1000000L
atxy2.menu.clock.20.bootloader.OSCCFG=0x02
atxy2.menu.clock.16.bootloader.OSCCFG=0x01
atxy2.menu.clock.10.bootloader.OSCCFG=0x02
atxy2.menu.clock.8.bootloader.OSCCFG=0x01
atxy2.menu.clock.5.bootloader.OSCCFG=0x02
atxy2.menu.clock.4.bootloader.OSCCFG=0x01
atxy2.menu.clock.1.bootloader.OSCCFG=0x01 

atxy2.menu.bodvoltage.1v8=1.8V
atxy2.menu.bodvoltage.2v15=2.15V
atxy2.menu.bodvoltage.2v6=2.6V
atxy2.menu.bodvoltage.2v95=2.95V
atxy2.menu.bodvoltage.3v3=3.30V
atxy2.menu.bodvoltage.3v7=3.70V
atxy2.menu.bodvoltage.4v0=4.00V
atxy2.menu.bodvoltage.4v3=4.30V
atxy2.menu.bodvoltage.4v3.bootloader.bodlevbits=111
atxy2.menu.bodvoltage.4v0.bootloader.bodlevbits=110
atxy2.menu.bodvoltage.3v7.bootloader.bodlevbits=101
atxy2.menu.bodvoltage.3v3.bootloader.bodlevbits=100
atxy2.menu.bodvoltage.2v95.bootloader.bodlevbits=011
atxy2.menu.bodvoltage.2v6.bootloader.bodlevbits=010
atxy2.menu.bodvoltage.2v15.bootloader.bodlevbits=001
atxy2.menu.bodvoltage.1v8.bootloader.bodlevbits=000
atxy2.menu.bodmodeactive.disabled=Disabled
atxy2.menu.bodmodeactive.enabled=Enabled
atxy2.menu.bodmodeactive.sampled=Sampled
atxy2.menu.bodmodeactive.enabledhold=Enabled hold wakeup
atxy2.menu.bodmodesleep.disabled=Disabled
atxy2.menu.bodmodesleep.enabled=Enabled
atxy2.menu.bodmodesleep.sampled=Sampled
atxy2.menu.bodmodeactive.disabled.bootloader.bodactivebits=00
atxy2.menu.bodmodeactive.enabled.bootloader.bodactivebits=01
atxy2.menu.bodmodeactive.sampled.bootloader.bodactivebits=10
atxy2.menu.bodmodeactive.enabledhold.bootloader.bodactivebits=11
atxy2.menu.bodmodesleep.disabled.bootloader.bodsleepbits=00
atxy2.menu.bodmodesleep.enabled.bootloader.bodsleepbits=01
atxy2.menu.bodmodesleep.sampled.bootloader.bodsleepbits=10

atxy2.menu.eesave.enable=EEPROM retained
atxy2.menu.eesave.enable.bootloader.SYSCFG0=0xC6
atxy2.menu.eesave.disable=EEPROM not retained
atxy2.menu.eesave.disable.bootloader.SYSCFG0=0xC7

atxy2.menu.dacvref.0v55=0.55V
atxy2.menu.dacvref.1v1=1.10V
atxy2.menu.dacvref.1v5=1.50V
atxy2.menu.dacvref.2v5=2.50V
atxy2.menu.dacvref.4v3=4.30V
atxy2.menu.dacvref.0v55.build.dacvref=-DDACVREF=0
atxy2.menu.dacvref.1v1.build.dacvref=-DDACVREF=1
atxy2.menu.dacvref.1v5.build.dacvref=-DDACVREF=4
atxy2.menu.dacvref.2v5.build.dacvref=-DDACVREF=2
atxy2.menu.dacvref.4v3.build.dacvref=-DDACVREF=3

atxy2.menu.millis.enabled=Enabled
atxy2.menu.millis.disabled=Disabled (saves flash)
atxy2.menu.millis.enabled.build.millis=
atxy2.menu.millis.disabled.build.millis=-DDISABLEMILLIS

