SpenceKonde/megaTinyCore/megaavr/boards.txt
atxy2.upload.tool=avrdude

atxy2.menu.bootmenu.none=none
atxy2.menu.bootmenu.none.upload.protocol=jtag2updi
atxy2.menu.bootmenu.none.upload.extra_params=-e
atxy2.menu.bootmenu.none.build.text_section_start=.text=0x0
atxy2.menu.bootmenu.none.bootloader.BOOTEND=0x0

atxy2.menu.bootmenu.optiboot=optiboot_x
atxy2.menu.bootmenu.optiboot.upload.protocol=arduino
atxy2.menu.bootmenu.optiboot.upload.extra_params=-D
atxy2.menu.bootmenu.optiboot.build.text_section_start=.text=0x200
atxy2.menu.bootmenu.optiboot.bootloader.file=optiboot_x/optiboot_atxy2.hex
atxy2.menu.bootmenu.optiboot.atxt2.bootloader.BOOTEND=0x2

atxy2.bootloader.tool=avrdude

atxy2.menu.uartpins.alternate=TX:2, RX:3
atxy2.menu.uartpins.standard=TX:0, RX:1
atxy2.menu.uartpins.alternate.build.uartpins=-DUARTREMAP
atxy2.menu.uartpins.standard.build.uartpins=

atxy2.build.board=attinyxy2
atxy2.build.core=arduino
atxy2.build.variant=txy2
atxy2.build.text_section_start=.text=0x0
atxy2.build.extra_flags=-DMILLIS_USE_TIMERA0 -DNO_EXTERNAL_I2C_PULLUP {build.dacvref} -DNEOPIXELPORT=VPORTA.OUT {build.millis} {build.uartpins}
atxy2.build.export_merged_output=false

atxy2.bootloader.tool=avrdude
atxy2.bootloader.WDTCFG=0x00
atxy2.bootloader.BODCFG=0b{bootloader.bodlevbits}0{bootloader.bodactivebits}{bootloader.bodsleepbits} 
atxy2.bootloader.TCD0CFG=0x00
atxy2.bootloader.SYSCFG0=0xC9
atxy2.bootloader.SYSCFG1=0x03
atxy2.bootloader.APPEND=0x00
#atxy2.bootloader.BOOTEND=0x00

#

# Xplained boards with Tiny-1 chips

Xplained416.name=Attiny416 Xplained Nano (optiboot)
Xplained416.build.mcu=attiny416
Xplained416.build.board=attinyxy6
Xplained416.build.core=arduino
Xplained416.build.variant=txy6
Xplained416.build.f_cpu=20000000
Xplained416.build.text_section_start=.text=0x200
Xplained416.build.extra_flags=-DMILLIS_USE_TIMERA0 -DNO_EXTERNAL_I2C_PULLUP -DUSE_TIMERD0_PWM -DDACVREF=3 -DNEOPIXELPORT=VPORTA.OUT
Xplained416.upload.tool=avrdude
Xplained416.upload.workaround=
Xplained416.upload.speed=57600
Xplained416.upload.maximum_size=3584
Xplained416.upload.maximum_data_size=256
Xplained416.upload.protocol=arduino
Xplained416.upload.extra_params=-D

Xplained817.name=Attiny817 Xplained Mini (optiboot)
Xplained817.build.mcu=attiny817
Xplained817.build.board=attinyxy7
Xplained817.build.core=arduino
Xplained817.build.variant=txy7
Xplained817.build.f_cpu=20000000
Xplained817.build.text_section_start=.text=0x200
Xplained817.build.extra_flags=-DMILLIS_USE_TIMERA0 -DNO_EXTERNAL_I2C_PULLUP -DUSE_TIMERD0_PWM -DDACVREF=3 -DNEOPIXELPORT=VPORTA.OUT
Xplained817.upload.tool=avrdude
Xplained817.upload.workaround=
Xplained817.upload.speed=57600
Xplained817.upload.maximum_size=7680
Xplained817.upload.maximum_data_size=512
Xplained817.upload.protocol=arduino
Xplained817.upload.extra_params=-D

# Separate board types for chips with Optiboot.  Reduces menu clutter.

atxy7o.name=ATtiny3217/1617/1607/817/807/417 (Optiboot)
atxy7o.upload.speed=115200

atxy7o.menu.chip.3217=ATtiny3217
atxy7o.menu.chip.3217.build.mcu=attiny3217
atxy7o.menu.chip.3217.upload.maximum_size=32256
atxy7o.menu.chip.3217.upload.maximum_data_size=2048
atxy7o.menu.chip.1617=ATtiny1617
atxy7o.menu.chip.1617.build.mcu=attiny1617
atxy7o.menu.chip.1617.upload.maximum_size=15872
atxy7o.menu.chip.1617.upload.maximum_data_size=2048
atxy7o.menu.chip.817=ATtiny817
atxy7o.menu.chip.817.build.mcu=attiny817
atxy7o.menu.chip.817.upload.maximum_size=7680
atxy7o.menu.chip.817.upload.maximum_data_size=512
atxy7o.menu.chip.417=ATtiny417
atxy7o.menu.chip.417.build.mcu=attiny417
atxy7o.menu.chip.417.upload.maximum_size=3584
atxy7o.menu.chip.417.upload.maximum_data_size=256
atxy7o.menu.chip.1607=ATtiny1607
atxy7o.menu.chip.1607.build.mcu=attiny1607
atxy7o.menu.chip.1607.upload.maximum_size=15872
atxy7o.menu.chip.1607.upload.maximum_data_size=1024
atxy7o.menu.chip.807=ATtiny807
atxy7o.menu.chip.807.build.mcu=attiny807
atxy7o.menu.chip.807.upload.maximum_size=7680
atxy7o.menu.chip.807.upload.maximum_data_size=512

atxy7o.menu.clock.20=20 MHz
atxy7o.menu.clock.16=16 MHz
atxy7o.menu.clock.10=10 MHz
atxy7o.menu.clock.8=8 MHz
atxy7o.menu.clock.5=5 MHz
atxy7o.menu.clock.4=4 MHz
atxy7o.menu.clock.1=1 MHz
atxy7o.menu.clock.20.build.f_cpu=20000000L
atxy7o.menu.clock.16.build.f_cpu=16000000L
atxy7o.menu.clock.10.build.f_cpu=10000000L
atxy7o.menu.clock.8.build.f_cpu=8000000L
atxy7o.menu.clock.5.build.f_cpu=5000000L
atxy7o.menu.clock.4.build.f_cpu=4000000L
atxy7o.menu.clock.1.build.f_cpu=1000000L

atxy7o.menu.dacvref.0v55=0.55V
atxy7o.menu.dacvref.1v1=1.10V
atxy7o.menu.dacvref.1v5=1.50V
atxy7o.menu.dacvref.2v5=2.50V
atxy7o.menu.dacvref.4v3=4.30V
atxy7o.menu.dacvref.0v55.build.dacvref=-DDACVREF=0
atxy7o.menu.dacvref.1v1.build.dacvref=-DDACVREF=1
atxy7o.menu.dacvref.1v5.build.dacvref=-DDACVREF=4
atxy7o.menu.dacvref.2v5.build.dacvref=-DDACVREF=2
atxy7o.menu.dacvref.4v3.build.dacvref=-DDACVREF=3

atxy7o.menu.millis.enabled=Enabled
atxy7o.menu.millis.disabled=Disabled (saves flash)
atxy7o.menu.millis.enabled.build.millis=
atxy7o.menu.millis.disabled.build.millis=-DDISABLEMILLIS

atxy7o.menu.neopixelport.porta=PORTA (pins 0~3,18~21)
atxy7o.menu.neopixelport.portb=PORTB (pins 4~11)
atxy7o.menu.neopixelport.portc=PORTC (pins 12~17)
atxy7o.menu.neopixelport.porta.build.neopixelport=-DNEOPIXELPORT=VPORTA.OUT
atxy7o.menu.neopixelport.portb.build.neopixelport=-DNEOPIXELPORT=VPORTB.OUT
atxy7o.menu.neopixelport.portc.build.neopixelport=-DNEOPIXELPORT=VPORTC.OUT

atxy7o.upload.tool=avrdude

atxy7o.build.board=attinyxy7
atxy7o.build.core=arduino
atxy7o.build.variant=txy7
atxy7o.build.extra_flags=-DMILLIS_USE_TIMERA0 -DNO_EXTERNAL_I2C_PULLUP -DUSE_TIMERD0_PWM {build.dacvref} {build.neopixelport} {build.millis}
atxy7o.build.export_merged_output=false

atxy7o.upload.protocol=arduino
atxy7o.upload.extra_params=-D
atxy7o.upload.workaround=
atxy7o.build.text_section_start=.text=0x200
atxy7o.bootloader.file=optiboot_x/optiboot_atxy7.hex
atxy7o.bootloader.BOOTEND=0x2
atxy7o.bootloader.tool=avrdude

##############################################################

atxy6o.name=ATtiny3216/1616/1606/816/806/416/406 (optiboot)
atxy6o.upload.speed=115200

atxy6o.menu.chip.3216=ATtiny3216
atxy6o.menu.chip.3216.build.mcu=attiny3216
atxy6o.menu.chip.3216.upload.maximum_size=32768
atxy6o.menu.chip.3216.upload.maximum_data_size=2048
atxy6o.menu.chip.1616=ATtiny1616
atxy6o.menu.chip.1616.build.mcu=attiny1616
atxy6o.menu.chip.1616.upload.maximum_size=16384
atxy6o.menu.chip.1616.upload.maximum_data_size=2048
atxy6o.menu.chip.816=ATtiny816
atxy6o.menu.chip.816.build.mcu=attiny816
atxy6o.menu.chip.816.upload.maximum_size=8192
atxy6o.menu.chip.816.upload.maximum_data_size=512
atxy6o.menu.chip.416=ATtiny416
atxy6o.menu.chip.416.build.mcu=attiny416
atxy6o.menu.chip.416.upload.maximum_size=4096
atxy6o.menu.chip.416.upload.maximum_data_size=256

atxy6o.menu.chip.1606=ATtiny1606
atxy6o.menu.chip.1606.build.mcu=attiny1606
atxy6o.menu.chip.1606.upload.maximum_size=16384
atxy6o.menu.chip.1606.upload.maximum_data_size=1024
atxy6o.menu.chip.806=ATtiny806
atxy6o.menu.chip.806.build.mcu=attiny806
atxy6o.menu.chip.806.upload.maximum_size=8192
atxy6o.menu.chip.806.upload.maximum_data_size=512
atxy6o.menu.chip.406=ATtiny406
atxy6o.menu.chip.406.build.mcu=attiny406
atxy6o.menu.chip.406.upload.maximum_size=4096
atxy6o.menu.chip.406.upload.maximum_data_size=256

atxy6o.menu.clock.20=20 MHz
atxy6o.menu.clock.16=16 MHz
atxy6o.menu.clock.10=10 MHz
atxy6o.menu.clock.8=8 MHz
atxy6o.menu.clock.5=5 MHz
atxy6o.menu.clock.4=4 MHz
atxy6o.menu.clock.1=1 MHz
atxy6o.menu.clock.20.build.f_cpu=20000000L
atxy6o.menu.clock.16.build.f_cpu=16000000L
atxy6o.menu.clock.10.build.f_cpu=10000000L
atxy6o.menu.clock.8.build.f_cpu=8000000L
atxy6o.menu.clock.5.build.f_cpu=5000000L
atxy6o.menu.clock.4.build.f_cpu=4000000L
atxy6o.menu.clock.1.build.f_cpu=1000000L

atxy6o.menu.dacvref.0v55=0.55V
atxy6o.menu.dacvref.1v1=1.10V
atxy6o.menu.dacvref.1v5=1.50V
atxy6o.menu.dacvref.2v5=2.50V
atxy6o.menu.dacvref.4v3=4.30V
atxy6o.menu.dacvref.0v55.build.dacvref=-DDACVREF=0
atxy6o.menu.dacvref.1v1.build.dacvref=-DDACVREF=1
atxy6o.menu.dacvref.1v5.build.dacvref=-DDACVREF=4
atxy6o.menu.dacvref.2v5.build.dacvref=-DDACVREF=2
atxy6o.menu.dacvref.4v3.build.dacvref=-DDACVREF=3

atxy6o.menu.millis.enabled=Enabled
atxy6o.menu.millis.disabled=Disabled (saves flash)
atxy6o.menu.millis.enabled.build.millis=
atxy6o.menu.millis.disabled.build.millis=-DDISABLEMILLIS

atxy6o.menu.neopixelport.porta=PORTA (pins 0~3,14~17)
atxy6o.menu.neopixelport.portb=PORTB (pins 4~9)
atxy6o.menu.neopixelport.portc=PORTC (pins 10~13)
atxy6o.menu.neopixelport.porta.build.neopixelport=-DNEOPIXELPORT=VPORTA.OUT
atxy6o.menu.neopixelport.portb.build.neopixelport=-DNEOPIXELPORT=VPORTB.OUT
atxy6o.menu.neopixelport.portc.build.neopixelport=-DNEOPIXELPORT=VPORTC.OUT

atxy6o.upload.tool=avrdude

