SpenceKonde/megaTinyCore/megaavr/boards.txt
atxy6o.build.board=attinyxy6
atxy6o.build.core=arduino
atxy6o.build.variant=txy6
atxy6o.build.text_section_start=.text=0x0
atxy6o.build.extra_flags=-DMILLIS_USE_TIMERA0 -DNO_EXTERNAL_I2C_PULLUP -DUSE_TIMERD0_PWM {build.dacvref} {build.neopixelport} {build.millis}
atxy6o.build.export_merged_output=false

atxy6o.upload.workaround=

atxy6o.upload.protocol=arduino
atxy6o.upload.extra_params=-D
atxy6o.build.text_section_start=.text=0x200
atxy6o.bootloader.file=optiboot_x/optiboot_atxy6o.hex
atxy6o.bootloader.BOOTEND=0x2
atxy6o.bootloader.tool=avrdude

##############################################################

atxy4o.name=ATtiny1614/1604/814/804/414/404/214/204 (optiboot)
atxy4o.upload.speed=115200

atxy4o.menu.chip.1614=ATtiny1614
atxy4o.menu.chip.1614.build.mcu=attiny1614
atxy4o.menu.chip.1614.upload.maximum_size=16384
atxy4o.menu.chip.1614.upload.maximum_data_size=2048
atxy4o.menu.chip.814=ATtiny814
atxy4o.menu.chip.814.build.mcu=attiny814
atxy4o.menu.chip.814.upload.maximum_size=8192
atxy4o.menu.chip.814.upload.maximum_data_size=512
atxy4o.menu.chip.414=ATtiny414
atxy4o.menu.chip.414.build.mcu=attiny414
atxy4o.menu.chip.414.upload.maximum_size=4096
atxy4o.menu.chip.414.upload.maximum_data_size=256
atxy4o.menu.chip.214=ATtiny214
atxy4o.menu.chip.214.build.mcu=attiny214
atxy4o.menu.chip.214.upload.maximum_size=2048
atxy4o.menu.chip.214.upload.maximum_data_size=128
atxy4o.menu.chip.1604=ATtiny1604
atxy4o.menu.chip.1604.build.mcu=attiny1604
atxy4o.menu.chip.1604.upload.maximum_size=16384
atxy4o.menu.chip.1604.upload.maximum_data_size=1024
atxy4o.menu.chip.804=ATtiny804
atxy4o.menu.chip.804.build.mcu=attiny804
atxy4o.menu.chip.804.upload.maximum_size=8192
atxy4o.menu.chip.804.upload.maximum_data_size=512
atxy4o.menu.chip.404=ATtiny404
atxy4o.menu.chip.404.build.mcu=attiny404
atxy4o.menu.chip.404.upload.maximum_size=4096
atxy4o.menu.chip.404.upload.maximum_data_size=256
atxy4o.menu.chip.204=ATtiny204
atxy4o.menu.chip.204.build.mcu=attiny204
atxy4o.menu.chip.204.upload.maximum_size=2048
atxy4o.menu.chip.204.upload.maximum_data_size=128

atxy4o.menu.clock.20=20 MHz
atxy4o.menu.clock.16=16 MHz
atxy4o.menu.clock.10=10 MHz
atxy4o.menu.clock.8=8 MHz
atxy4o.menu.clock.5=5 MHz
atxy4o.menu.clock.4=4 MHz
atxy4o.menu.clock.1=1 MHz
atxy4o.menu.clock.20.build.f_cpu=20000000L
atxy4o.menu.clock.16.build.f_cpu=16000000L
atxy4o.menu.clock.10.build.f_cpu=10000000L
atxy4o.menu.clock.8.build.f_cpu=8000000L
atxy4o.menu.clock.5.build.f_cpu=5000000L
atxy4o.menu.clock.4.build.f_cpu=4000000L
atxy4o.menu.clock.1.build.f_cpu=1000000L
atxy4o.menu.clock.20.bootloader.OSCCFG=0x02
atxy4o.menu.clock.16.bootloader.OSCCFG=0x01
atxy4o.menu.clock.10.bootloader.OSCCFG=0x02
atxy4o.menu.clock.8.bootloader.OSCCFG=0x01
atxy4o.menu.clock.5.bootloader.OSCCFG=0x02
atxy4o.menu.clock.4.bootloader.OSCCFG=0x01
atxy4o.menu.clock.1.bootloader.OSCCFG=0x01 

atxy4o.menu.dacvref.0v55=0.55V
atxy4o.menu.dacvref.1v1=1.10V
atxy4o.menu.dacvref.1v5=1.50V
atxy4o.menu.dacvref.2v5=2.50V
atxy4o.menu.dacvref.4v3=4.30V
atxy4o.menu.dacvref.0v55.build.dacvref=-DDACVREF=0
atxy4o.menu.dacvref.1v1.build.dacvref=-DDACVREF=1
atxy4o.menu.dacvref.1v5.build.dacvref=-DDACVREF=4
atxy4o.menu.dacvref.2v5.build.dacvref=-DDACVREF=2
atxy4o.menu.dacvref.4v3.build.dacvref=-DDACVREF=3

atxy4o.menu.millis.enabled=Enabled
atxy4o.menu.millis.disabled=Disabled (saves flash)
atxy4o.menu.millis.enabled.build.millis=
atxy4o.menu.millis.disabled.build.millis=-DDISABLEMILLIS

atxy4o.menu.neopixelport.porta=PORTA (pins 0~3,8~11)
atxy4o.menu.neopixelport.portb=PORTB (pins 4~7)
atxy4o.menu.neopixelport.porta.build.neopixelport=-DNEOPIXELPORT=VPORTA.OUT
atxy4o.menu.neopixelport.portb.build.neopixelport=-DNEOPIXELPORT=VPORTB.OUT

atxy4o.upload.tool=avrdude

atxy4o.build.board=attinyxy4
atxy4o.build.core=arduino
atxy4o.build.variant=txy4
atxy4o.build.text_section_start=.text=0x0
atxy4o.build.extra_flags=-DMILLIS_USE_TIMERA0 -DNO_EXTERNAL_I2C_PULLUP {build.dacvref} {build.neopixelport} {build.millis}
atxy4o.build.export_merged_output=false

atxy4o.upload.workaround=
atxy4o.upload.protocol=arduino
atxy4o.upload.extra_params=-D
atxy4o.build.text_section_start=.text=0x200
atxy4o.bootloader.file=optiboot_x/optiboot_atxy4.hex
atxy4o.bootloader.BOOTEND=0x2
atxy4o.bootloader.tool=avrdude


##############################################################

atxy2o.name=ATtiny412/402/212/202 (optiboot)
atxy2o.upload.speed=115200

#atxy2o.menu.chip.812=ATtiny812
#atxy2o.menu.chip.812.build.mcu=attiny812
#atxy2o.menu.chip.812.upload.maximum_size=8192
#atxy2o.menu.chip.812.upload.maximum_data_size=512
#atxy2o.menu.chip.812.upload.workaround=
atxy2o.menu.chip.412=ATtiny412
atxy2o.menu.chip.412.build.mcu=attiny412
atxy2o.menu.chip.412.upload.maximum_size=4096
atxy2o.menu.chip.412.upload.maximum_data_size=256
atxy2o.menu.chip.412.upload.workaround=
atxy2o.menu.chip.212=ATtiny212
atxy2o.menu.chip.212.build.mcu=attiny212
atxy2o.menu.chip.212.upload.maximum_size=2048
atxy2o.menu.chip.212.upload.maximum_data_size=128
atxy2o.menu.chip.212.upload.workaround=
#atxy2o.menu.chip.802=ATtiny802
#atxy2o.menu.chip.802.build.mcu=attiny802
#atxy2o.menu.chip.802.upload.maximum_size=8192
#atxy2o.menu.chip.802.upload.maximum_data_size=512
#atxy2o.menu.chip.802.upload.workaround=
atxy2o.menu.chip.402=ATtiny402
atxy2o.menu.chip.402.build.mcu=attiny402
atxy2o.menu.chip.402.upload.maximum_size=4096
atxy2o.menu.chip.402.upload.maximum_data_size=256
atxy2o.menu.chip.402.upload.workaround=
atxy2o.menu.chip.402w=ATtiny402 (bad signature)
atxy2o.menu.chip.402w.build.mcu=attiny402
atxy2o.menu.chip.402w.upload.maximum_size=4096
atxy2o.menu.chip.402w.upload.maximum_data_size=256
atxy2o.menu.chip.402w.upload.workaround=w
atxy2o.menu.chip.202=ATtiny202
atxy2o.menu.chip.202.build.mcu=attiny202
atxy2o.menu.chip.202.upload.maximum_size=2048
atxy2o.menu.chip.202.upload.maximum_data_size=128
atxy2o.menu.chip.202.upload.workaround=

atxy2o.menu.clock.20=20 MHz
atxy2o.menu.clock.16=16 MHz
atxy2o.menu.clock.10=10 MHz
atxy2o.menu.clock.8=8 MHz
atxy2o.menu.clock.5=5 MHz
atxy2o.menu.clock.4=4 MHz
atxy2o.menu.clock.1=1 MHz
atxy2o.menu.clock.20.build.f_cpu=20000000L
atxy2o.menu.clock.16.build.f_cpu=16000000L
atxy2o.menu.clock.10.build.f_cpu=10000000L
atxy2o.menu.clock.8.build.f_cpu=8000000L
atxy2o.menu.clock.5.build.f_cpu=5000000L
atxy2o.menu.clock.4.build.f_cpu=4000000L
atxy2o.menu.clock.1.build.f_cpu=1000000L

atxy2o.menu.dacvref.0v55=0.55V
atxy2o.menu.dacvref.1v1=1.10V
atxy2o.menu.dacvref.1v5=1.50V
atxy2o.menu.dacvref.2v5=2.50V
atxy2o.menu.dacvref.4v3=4.30V
atxy2o.menu.dacvref.0v55.build.dacvref=-DDACVREF=0
atxy2o.menu.dacvref.1v1.build.dacvref=-DDACVREF=1
atxy2o.menu.dacvref.1v5.build.dacvref=-DDACVREF=4
atxy2o.menu.dacvref.2v5.build.dacvref=-DDACVREF=2
atxy2o.menu.dacvref.4v3.build.dacvref=-DDACVREF=3

atxy2o.menu.millis.enabled=Enabled
atxy2o.menu.millis.disabled=Disabled (saves flash)
atxy2o.menu.millis.enabled.build.millis=
atxy2o.menu.millis.disabled.build.millis=-DDISABLEMILLIS

atxy2o.upload.tool=avrdude
atxy2o.upload.protocol=arduino
atxy2o.upload.extra_params=-D
atxy2o.build.text_section_start=.text=0x200
atxy2o.bootloader.file=optiboot_x/optiboot_atxy2.hex
atxy2o.bootloader.BOOTEND=0x2
atxy2o.bootloader.tool=avrdude


atxy2o.menu.uartpins.alternate=TX:2, RX:3
atxy2o.menu.uartpins.standard=TX:0, RX:1
atxy2o.menu.uartpins.alternate.build.uartpins=-DUARTREMAP
atxy2o.menu.uartpins.standard.build.uartpins=

atxy2o.build.board=attinyxy2
atxy2o.build.core=arduino
atxy2o.build.variant=txy2
atxy2o.build.text_section_start=.text=0x0
atxy2o.build.extra_flags=-DMILLIS_USE_TIMERA0 -DNO_EXTERNAL_I2C_PULLUP {build.dacvref} -DNEOPIXELPORT=VPORTA.OUT {build.millis} {build.uartpins}
atxy2o.build.export_merged_output=false
